src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <basedOn>Document.РеализацияТоваров</basedOn>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Договоры/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Владелец = ДанныеЗаполнения.Контрагент;
	Наименование = ДанныеЗаполнения.Ссылка;
	ДатаПоставки = ДанныеЗаполнения.Дата;
	Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
		НоваяСтрока = Состав.Добавить();
		НоваяСтрока.Количество = ТекСтрокаСостав.Количество;
		НоваяСтрока.Номенклатура = ТекСтрокаСостав.Номенклатура;
	КонецЦикла;

КонецПроцедуры
